app/controllers/todo_items_controller.rb

	def create
		@todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "wow"], ["created_at", "2014-11-02 17:49:54.555894"], ["todo_list_id", 1], ["updated_at", "2014-11-02 17:49:54.555894"]]

	def destroy
		if @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]